kafka-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Kafka Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <com.di.jmeter.kafka.config.KafkaProducerConfig guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.config.KafkaProducerConfig" testname="Kafka Producer Config">
        <stringProp name="kafkaProducerClientVariableName">kafkaProducerClient</stringProp>
        <stringProp name="kafkaBrokers">localhost:9092</stringProp>
        <stringProp name="batchSize">16384</stringProp>
        <stringProp name="serializerKey">org.apache.kafka.common.serialization.StringSerializer</stringProp>
        <stringProp name="serializerValue">org.apache.kafka.common.serialization.StringSerializer</stringProp>
        <stringProp name="securityType">securityType.plaintext</stringProp>
        <collectionProp name="extraConfigs"/>
      </com.di.jmeter.kafka.config.KafkaProducerConfig>
      <hashTree/>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="Concurrency Thread Group - Kafka Load" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="com.blazemeter.jmeter.control.VirtualUserController"/>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TargetLevel">20</stringProp>
        <stringProp name="RampUp">0</stringProp>
        <stringProp name="Steps">1</stringProp>
        <stringProp name="Hold">1200</stringProp>
        <stringProp name="Unit">S</stringProp>
        <boolProp name="same_user_on_next_iteration">true</boolProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate UUID and Head" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.util.UUID
import java.util.concurrent.atomic.AtomicInteger

if (props.get(&quot;globalCounter&quot;) == null) {
    props.put(&quot;globalCounter&quot;, new AtomicInteger(0))
}

def counter = props.get(&quot;globalCounter&quot;).incrementAndGet()

def uuid = UUID.randomUUID().toString()

def head = true

if (counter % 10 == 0) {
    head = false
}

vars.put(&quot;msg_uuid&quot;, uuid)
vars.put(&quot;head&quot;, head.toString())</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <com.di.jmeter.kafka.sampler.KafkaProducerSampler guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.sampler.KafkaProducerSampler" testname="Kafka Producer Sampler" enabled="true">
          <stringProp name="kafkaProducerClientVariableName">kafkaProducerClient</stringProp>
          <stringProp name="kafkaTopic">test-topic</stringProp>
          <stringProp name="kafkaMessageKey">${msg_uuid}</stringProp>
          <stringProp name="kafkaMessage">{&quot;msg_uuid&quot;:&quot;${msg_uuid}&quot;,&quot;head&quot;:${head},&quot;method&quot;:&quot;POST&quot;,&quot;uri&quot;:&quot;/post-message&quot;}</stringProp>
          <collectionProp name="messageHeaders"/>
        </com.di.jmeter.kafka.sampler.KafkaProducerSampler>
        <hashTree/>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="84589817">
              <stringProp name="49">5</stringProp>
              <stringProp name="50">5</stringProp>
              <stringProp name="51">300</stringProp>
            </collectionProp>
            <collectionProp name="86091705">
              <stringProp name="49">10</stringProp>
              <stringProp name="50">10</stringProp>
              <stringProp name="51">300</stringProp>
            </collectionProp>
            <collectionProp name="86093689">
              <stringProp name="49">12</stringProp>
              <stringProp name="50">12</stringProp>
              <stringProp name="51">300</stringProp>
            </collectionProp>
            <collectionProp name="86095673">
              <stringProp name="49">14</stringProp>
              <stringProp name="50">14</stringProp>
              <stringProp name="51">300</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="InfluxDB Backend Listener" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="influxdbMetricsSender" elementType="Argument">
                <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="influxdbUrl" elementType="Argument">
                <stringProp name="Argument.name">influxdbUrl</stringProp>
                <stringProp name="Argument.value">http://localhost:8086/write?db=jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="application" elementType="Argument">
                <stringProp name="Argument.name">application</stringProp>
                <stringProp name="Argument.value">kafka-load-test</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="measurement" elementType="Argument">
                <stringProp name="Argument.name">measurement</stringProp>
                <stringProp name="Argument.value">jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="summaryOnly" elementType="Argument">
                <stringProp name="Argument.name">summaryOnly</stringProp>
                <stringProp name="Argument.value">false</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="samplersRegex" elementType="Argument">
                <stringProp name="Argument.name">samplersRegex</stringProp>
                <stringProp name="Argument.value">.*</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="percentiles" elementType="Argument">
                <stringProp name="Argument.name">percentiles</stringProp>
                <stringProp name="Argument.value">90;95;99</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="testTitle" elementType="Argument">
                <stringProp name="Argument.name">testTitle</stringProp>
                <stringProp name="Argument.value">Kafka Load Test</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="eventTags" elementType="Argument">
                <stringProp name="Argument.name">eventTags</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
        </BackendListener>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>