report/statistics.json
{
  "Kafka Producer Sampler" : {
    "transaction" : "Kafka Producer Sampler",
    "sampleCount" : 10556,
    "errorCount" : 4,
    "errorPct" : 0.037893143,
    "meanResTime" : 0.7143804471390645,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 8.792988266575149,
    "receivedKBytesPerSec" : 0.06018315671277516,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10556,
    "errorCount" : 4,
    "errorPct" : 0.037893143,
    "meanResTime" : 0.7143804471390645,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 8.792988266575149,
    "receivedKBytesPerSec" : 0.06018315671277516,
    "sentKBytesPerSec" : 0.0
  }
}